In [3]:
import pandas as pd

In [4]:
df=pd.read_csv('results.csv')

In [3]:
df

,Roll_no,Hindi,English,Science,Maths,History,Geograpgy,Total,Gender
0,1,94,56,4,67,91,50,362,Female
1,2,7,85,76,99,60,25,352,Female
2,3,88,46,59,94,52,38,377,Female
3,4,39,81,37,38,6,54,255,Female
4,5,51,43,14,53,64,59,284,Female
...,...,...,...,...,...,...,...,...,...
995,996,42,62,25,87,51,68,335,Male
996,997,9,83,70,14,11,78,265,Male
997,998,23,82,31,42,84,52,314,Male
998,999,75,78,68,33,79,91,424,Male
999,1000,72,25,74,89,91,27,378,Male

In [4]:
df.head()

   Roll_no  Hindi  English  Science  Maths  History  Geograpgy  Total  Gender
0        1     94       56        4     67       91         50    362  Female
1        2      7       85       76     99       60         25    352  Female
2        3     88       46       59     94       52         38    377  Female
3        4     39       81       37     38        6         54    255  Female
4        5     51       43       14     53       64         59    284  Female

In [6]:
df.tail()

     Roll_no  Hindi  English  Science  Maths  History  Geograpgy  Total Gender
995      996     42       62       25     87       51         68    335   Male
996      997      9       83       70     14       11         78    265   Male
997      998     23       82       31     42       84         52    314   Male
998      999     75       78       68     33       79         91    424   Male
999     1000     72       25       74     89       91         27    378   Male

In [7]:
df.describe()

,Roll_no,Hindi,English,Science,Maths,History,Geograpgy,Total
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,51.652000,50.125000,49.455000,49.639000,49.054000,50.018000,299.943000
std,288.819436,29.475918,28.031038,28.929966,28.621633,28.791979,28.716551,71.886768
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,103.000000
25%,250.750000,26.000000,26.000000,25.000000,26.000000,24.000000,26.000000,254.000000
50%,500.500000,53.000000,50.500000,50.000000,49.000000,49.000000,49.000000,296.000000
75%,750.250000,77.000000,75.000000,74.000000,74.000000,74.000000,75.000000,350.000000
max,1000.000000,99.000000,99.000000,99.000000,99.000000,99.000000,99.000000,505.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Roll_no    1000 non-null   int64
 1   Hindi      1000 non-null   int64
 2   English    1000 non-null   int64
 3   Science    1000 non-null   int64
 4   Maths      1000 non-null   int64
 5   History    1000 non-null   int64
 6   Geograpgy  1000 non-null   int64
 7   Total      1000 non-null   int64
 8   Gender     1000 non-null   object
dtypes: int64(8), object(1)
memory usage: 70.4+ KB

In [10]:
df['Gender'].value_counts()
#we can see there are more male students

Gender
Male      600
Female    400
Name: count, dtype: int64

In [6]:
df.shape

(1000, 9)

In [7]:
df.size

9000

In [8]:
df.columns

Index(['Roll_no', 'Hindi', 'English', 'Science', 'Maths', 'History',
       'Geograpgy', 'Total', 'Gender'],
      dtype='object')

In [9]:
df.nunique()

Roll_no      1000
Hindi         100
English       100
Science       100
Maths         100
History       100
Geograpgy     100
Total         298
Gender          2
dtype: int64

In [11]:
df.isnull().sum()

Roll_no      0
Hindi        0
English      0
Science      0
Maths        0
History      0
Geograpgy    0
Total        0
Gender       0
dtype: int64